tutorials/rigidBodyAndBeam/rigidBodyAndBeam_loop_nOuter8/0/beam/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
59
(
(-1.02912e-20 -5.17403e-05 -1.22855e-18)
(-9.9203e-21 -2.07783e-05 -1.62524e-19)
(-9.55137e-21 -3.93063e-05 -4.07406e-19)
(-9.18097e-21 -2.8219e-05 1.14979e-19)
(-8.8112e-21 -3.48538e-05 8.39777e-20)
(-8.44091e-21 -3.08834e-05 3.07394e-19)
(-8.07078e-21 -3.32593e-05 3.20153e-19)
(-7.7005e-21 -3.18376e-05 3.42691e-19)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-1.3795e-33 -6.03837e-35 1.22379e-37);
    }
    right
    {
        type            calculated;
        value           uniform (-9.91718e-34 8.75657e-25 -6.90131e-38);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
